595. Big Countries

Table: World

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| name        | varchar |

| continent   | varchar |

| area        | int     |

| population  | int     |

| gdp         | int     |

+-------------+---------+

name is the primary key column for this table.

Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.

A country is big if:

    it has an area of at least three million (i.e., 3000000 km2), or
    it has a population of at least twenty-five million (i.e., 25000000).

Write an SQL query to report the name, population, and area of the big countries.

Return the result table in any order.

In [ ]:
# Write your MySQL query statement below
SELECT name,population,area 
FROM World 
WHERE population>=25000000 OR area>=3000000;

 1757. Recyclable and Low Fat Products

Table: Products

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| product_id  | int     |

| low_fats    | enum    |

| recyclable  | enum    |

+-------------+---------+

product_id is the primary key for this table.

low_fats is an ENUM of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.

recyclable is an ENUM of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

Write an SQL query to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

In [ ]:
SELECT product_id 
FROM Products
WHERE low_fats = 'Y' AND recyclable = 'Y';

183. Customers Who Never Order

Table: Customer

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| name        | varchar |

| referee_id  | int     |

+-------------+---------+

id is the primary key column for this table.

Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.

Write an SQL query to report the names of the customer that are not referred by the customer with id = 2.

Return the result table in any order.

In [ ]:
SELECT name
FROM Customer
WHERE referee_id != 2 OR referee_id IS NULL;

175. Combine Two Tables

Table: Person

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| personId    | int     |

| lastName    | varchar |

| firstName   | varchar |

+-------------+---------+

personId is the primary key column for this table.

This table contains information about the ID of some persons and their first and last names.

 
Table: Address

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| addressId   | int     |

| personId    | int     |

| city        | varchar |

| state       | varchar |

+-------------+---------+
addressId is the primary key column for this table.

Each row of this table contains information about the city and state of one person with ID = PersonId.

 

Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

In [ ]:
# Write your MySQL query statement below
select FirstName, LastName, City, State from Person 
left join Address on Person.personId = Address.personId;

176. Second Highest Salary

Table: Employee

+-------------+------+

| Column Name | Type |

+-------------+------+

| id          | int  |

| salary      | int  |

+-------------+------+

id is the primary key column for this table.

Each row of this table contains information about the salary of an employee.

Write an SQL query to report the second highest salary from the Employee table. If there is no second highest salary, the query should report null.

In [ ]:
# Write your MySQL query statement below
SELECT max(Salary) AS SecondHighestSalary
FROM Employee
WHERE Salary < (SELECT max(Salary) FROM Employee)

196. Delete Duplicate Emails

Write an SQL query to delete all the duplicate emails, keeping only one unique email with the smallest id. Note that you are supposed to write a DELETE statement and not a SELECT one.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

In [ ]:
# Write your MySQL query statement below
DELETE p1 FROM Person p1, Person p2
WHERE p1.email = p2.email AND p1.Id > p2.Id

584. Find Customer Referee

Table: Customer

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| name        | varchar |

| referee_id  | int     |

+-------------+---------+

id is the primary key column for this table.

Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.

Write an SQL query to report the names of the customer that are not referred by the customer with id = 2.

Return the result table in any order.

In [ ]:
# Write your MySQL query statement below
SELECT name FROM Customer
WHERE referee_id != 2 OR referee_id IS NULL;

1795. Rearrange Products Table

Table: Products

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| product_id  | int     |

| store1      | int     |

| store2      | int     |

| store3      | int     |

+-------------+---------+

product_id is the primary key for this table.

Each row in this table indicates the product's price in 3 different stores: store1, store2, and store3.

If the product is not available in a store, the price will be null in that store's column.

Write an SQL query to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.

Return the result table in any order.

In [ ]:
# Write your MySQL query statement below
SELECT product_id, 'store1' AS store, store1 AS price FROM Products WHERE store1 IS NOT NULL
UNION 
SELECT product_id, 'store2' AS store, store2 AS price FROM Products WHERE store2 IS NOT NULL
UNION 
SELECT product_id, 'store3' AS store, store3 AS price FROM Products WHERE store3 IS NOT NULL

180. Consecutive Numbers

Table: Logs

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| num         | varchar |

+-------------+---------+

id is the primary key for this table.

id is an autoincrement column.


Write an SQL query to find all numbers that appear at least three times consecutively.

Return the result table in any order.

In [ ]:
# Write your MySQL query statement below
select distinct l1.num AS ConsecutiveNums 
from Logs l1 
    join Logs l2 on l1.id=l2.id-1 
    join Logs l3 on l1.id=l3.id-2
where l1.num=l2.num and l2.num=l3.num